// Reznik-Lab05-V7.cpp : This file contains the 'main' function. Program execution begins and ends there.
// author Reznik D.O. student of group 222z (online)

//Визначити кількість додатних і від’ємних елементів матриці. Розмір мариці вводити з клавіатури, елементи, а також результат, розмістити в пам’яті динамічно.

#include <iostream>  // Підключаємо бібліотеку для роботи з введенням/виведенням.
#include <cstdlib>   // Підключаємо бібліотеку для роботи з функціями генерації випадкових чисел (rand()).
#include <ctime>     // Підключаємо бібліотеку для роботи з функцією time().
using namespace std; // Використовуємо простір імен std для спрощення запису.

int main() // Початок головної функції програми.
{
    srand(time(0)); // Ініціалізуємо генератор випадкових чисел поточним часом.

    int row = 0; // Змінна для кількості рядків матриці.
    int cols = 0; // Змінна для кількості стовпців матриці.

    cout << "Enter size of array N M " << endl; // Виводимо запрошення для введення розміру масиву.
    cin >> row >> cols; // Зчитуємо кількість рядків (row) і стовпців (cols).

    int** mas = new int* [row]; // Виділяємо пам'ять для рядків динамічного двовимірного масиву.
    for (int i = 0; i < row; i++) {
        mas[i] = new int[cols]; // Виділяємо пам'ять для стовпців кожного рядка.
    }

    for (int i = 0; i < row; i++) { // Ітерація по рядках.
        for (int j = 0; j < cols; j++) { // Ітерація по стовпцях.
            mas[i][j] = rand() % 201 - 100; // Заповнюємо масив випадковими числами від -100 до 100.
        }
    }

    cout << "You have an array size " << row << "*" << cols << endl; // Повідомляємо розмір створеного масиву.

    for (int i = 0; i < row; i++) { // Ітерація по рядках для виводу початкового масиву.
        for (int j = 0; j < cols; j++) { // Ітерація по стовпцях.
            cout << mas[i][j] << "  "; // Виводимо елемент масиву.
        }
        cout << endl; // Перехід до нового рядка після виводу одного рядка масиву.
    }

    cout << endl; // Додаємо порожній рядок для зручності читання.

    int positive = 0, negative = 0; // Ініціалізація лічильників для додатних та від'ємних елементів

    for (int i = 0; i < row; ++i) { // Починаємо цикл по рядках матриці
        for (int j = 0; j < cols; ++j) { // Починаємо цикл по стовпцях поточного рядка
            if (mas[i][j] > 0) { // Якщо елемент матриці додатний
                ++positive; // Збільшуємо лічильник додатних елементів
            }
            else if (mas[i][j] < 0) { // Якщо елемент матриці від'ємний
                ++negative; // Збільшуємо лічильник від'ємних елементів
            }
        }
    }

    cout << "Number of positive elements: " << positive << endl; // Виводимо кількість додатних елементів
    cout << "Number of negative elements: " << negative << endl; // Виводимо кількість від'ємних елементів


    for (int i = 0; i < row; ++i) {
        delete[] mas[i]; // Звільнення пам'яті для кожного рядка матриці (масивів, що є елементами "верхнього" масиву)
    }
    delete[] mas; // Звільнення пам'яті для основного масиву вказівників (верхнього рівня матриці)

    return 0; // Завершення програми з успішним статусом.
}


// Run program: Ctrl + F5 or Debug > Start Without Debugging menu
// Debug program: F5 or Debug > Start Debugging menu